app/controllers/home_controller.rb

SELECT "portfolios".* FROM "portfolios"
---
  def index
    @portfolio = Portfolio.all