app/controllers/portfolios_controller.rb

  def create
    @portfolio = Portfolio.new portfolio_params

    if @portfolio.save
---
INSERT INTO "portfolios" ("name", "description", "role", "tasks", "site", "background_file_name", "background_content_type", "background_file_size", "background_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @portfolio.update portfolio_params
---
UPDATE "portfolios" SET "role" = ?, "tasks" = ?, "updated_at" = ? WHERE "portfolios"."id" = ?  [["role", "Web Designer, Graphic Designer"], ["tasks", "Website, Logo"], ["updated_at", "2017-02-02 02:14:41.715812"], ["id", 1]]

  def find_portfolio
    @portfolio = Portfolio.find(params[:id])
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT 1  [["id", 1]]